<template>
  <div>
    <a name="home"></a>
    <section class="home">
      <header class="home__header">
        <p class="home__text">
          Hello! I'm <span class="home__text_highlight">Elena Kalichkina</span>.
          I'm frontend web developer.
        </p>
      </header>
      <base-button text="My projects" color="dark" @click="toProjects" />
    </section>
    <!-- <section class="nav"> -->
      <ul class="nav">
        <li class="nav__item" v-for="nav in navs" :key="nav" @click="setActiveNav(nav)">
          <a class="nav__a" :class="{'nav__a_active': activeNav === nav}" :href="`#${nav}`">
            {{ nav }}
          </a>
        </li>
      </ul>
    <!-- </section> -->
    <a name="about"></a>
    <section class="about" ref="about">
      Разнообразный и богатый опыт укрепление и развитие структуры позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа систем массового участия. Не следует, однако забывать, что укрепление и развитие структуры требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности позволяет выполнять важные задания по разработке новых предложений. Повседневная практика показывает, что укрепление и развитие структуры в значительной степени обуславливает создание существенных финансовых и административных условий. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач.

Товарищи! дальнейшее развитие различных форм деятельности представляет собой интересный эксперимент проверки новых предложений. Равным образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании модели развития. Товарищи! реализация намеченных плановых заданий позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Не следует, однако забывать, что консультация с широким активом позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач.

Повседневная практика показывает, что укрепление и развитие структуры в значительной степени обуславливает создание форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий в значительной степени обуславливает создание дальнейших направлений развития. Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа систем массового участия.
    <img src="https://www.rosphoto.com/images/u/articles/1510/7_5.jpg" alt="">
    </section>
    
    <a name="portfolio"></a>
    <section class="portfolio" ref="portfolio">
      Повседневная практика показывает, что консультация с широким активом представляет собой интересный эксперимент проверки модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании систем массового участия. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке дальнейших направлений развития.

Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации направлений прогрессивного развития. Не следует, однако забывать, что сложившаяся структура организации позволяет выполнять важные задания по разработке существенных финансовых и административных условий.
 Повседневная практика показывает, что консультация с широким активом представляет собой интересный эксперимент проверки модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании систем массового участия. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке дальнейших направлений развития.

Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации направлений прогрессивного развития. Не следует, однако забывать, что сложившаяся структура организации позволяет выполнять важные задания по разработке существенных финансовых и административных условий.
 Повседневная практика показывает, что консультация с широким активом представляет собой интересный эксперимент проверки модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании систем массового участия. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке дальнейших направлений развития.

Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации направлений прогрессивного развития. Не следует, однако забывать, что сложившаяся структура организации позволяет выполнять важные задания по разработке существенных финансовых и административных условий.
 Повседневная практика показывает, что консультация с широким активом представляет собой интересный эксперимент проверки модели развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании систем массового участия. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации новых предложений. Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке дальнейших направлений развития.

Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации направлений прогрессивного развития. Не следует, однако забывать, что сложившаяся структура организации позволяет выполнять важные задания по разработке существенных финансовых и административных условий.
    </section>
  </div>
</template>

<script>
import BaseButton from '@/components/BaseButton.vue'
export default {
  name: 'IndexPage',
  components: {
    BaseButton,
  },
  data() {
    return {
      activeNav: 'home'
    }
  },
  mounted() {
    this.checkHeaderPosition();
  },
  computed: {
    navs() {
      return ['home', 'about', 'portfolio', 'contact']
    }
  },
  methods: {
    setActiveNav(nav) {
      this.activeNav = nav;
    },
    checkHeaderPosition() {
      const observer = new IntersectionObserver((entries) =>
      {
        entries.forEach(entry => {
          if(entry.intersectionRatio > 0) {
            this.activeNav = entry.target.name;
            // console.log(entry.target.name);
          }
        })
      })
     document.querySelectorAll('div a').forEach((a) =>{
      observer.observe(a);
     })
    },
    toProjects() {
      this.$refs.portfolio.scrollIntoView();
      console.log('ref', this.$refs.portfolio);
    }
  },
}
</script>

<style lang="scss" scoped>
.home {
  font-family: 'GothamProMedium', sans-serif;
  color: $white;
  font-size: 32pt;
  line-height: 36pt;
  background: $black700;
  background-image: url(https://i.gifer.com/2iiH.gif);
  height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  &__header {
    display: flex;
    justify-content: center;
    align-items: center;
    margin-bottom: 10px;
  }
  &__text {
    max-width: 50%;
    text-align: center;
    &_highlight {
      color: $darkTurquoise;
    }
  }
}
.nav {
  background: $black700;
  display: flex;
  align-items: center;
  padding: 0 10%;
  position: sticky;
  top: 0px;
  &__item {
    margin: 10px;
  }
  &__a {
    color: $white;
    &_active {
      color: $darkTurquoise;
    }
  }
}

.about {}
</style>
